{
  "1": [
    {
      "title": "My First Blog Post",
      "id": "my-first-blog-post",
      "published": "2018-01-16 20:51:29.752493Z",
      "snippet": "With the help of my favourite programming language (Dart) and this amazing, front-end hosting service called Netlify, I have finally created my own blog. In a world where services like Wordpress and Blogger exist, you may ask: \"Why bother creating your own blog?\"",
      "updated": "2018-01-16 21:21:55.125130Z"
    },
    {
      "title": "Project QUIK",
      "id": "project-quik",
      "published": "2018-01-23 19:14:31.613147Z",
      "snippet": "So it all started with a game called Brain Genius by the company Glu. It was one of those mobile flash games that my Mum let me play on her Nokia phone as a child while I waited for her and my friend's Mum to stop talking and finally take me home. It was a fairly typical brain tr...",
      "updated": "2018-01-23 19:29:23.445405Z"
    }
  ],
  "2": [
    {
      "title": "Project July",
      "id": "project-july",
      "published": "2018-02-12 16:50:33.058560Z",
      "snippet": "In my last post I concluded that the project I decided to work on was too small in scope and too small in ambition. So much so that I was not in any way enthusiastic about showing it off to the wider world. I’m happy to announce that I am now doing the opposite; I have started a ...",
      "updated": "2018-02-12 17:02:32.338275Z"
    }
  ],
  "3": [
    {
      "title": "Jamming Spree",
      "id": "jamming-spree",
      "published": "2018-03-28 21:37:03.148568Z",
      "snippet": "I originally began writing this blog post about the PIZZA JAM game I made in February but I have done two more since then and I thought it’d be nice to touch on them all briefly in one post. "
    }
  ],
  "5": [
    {
      "title": "Project July Update #1",
      "id": "project-july-update-1",
      "published": "2018-05-23 16:07:52.356802Z",
      "snippet": "I have not spent as much time on the developing the core combat mechanics as I hoped. It is slowly but surely getting there and I am proud of what I have done so far. I haven't completely finished what I said I was going to be working on in my last post about Project July, but I ..."
    }
  ]
}